TEST
# hi

In [20]:
print("hi")

hi

In [2]:
import numpy as np
import pandas as pd

In [3]:
df_students = pd.DataFrame({
    "Name" : ["Peter", "Luis", "Pep", "Susi", "Pepa", "Jaume"],
    "StudyHours" : [8, 7 ,0, 9, 9, 0],
    "Grade": [9, 9, 0 ,5 ,6, 4]
})
df_students[df_students.StudyHours > df_students.StudyHours.mean()]

    Name  StudyHours  Grade
0  Peter           8      9
1   Luis           7      9
3   Susi           9      5
4   Pepa           9      6

In [24]:
passed = pd.Series(df_students.Grade >= 5)
df_students = pd.concat([df_students, passed.rename("Passed")],axis= 1)
df_students

    Name  StudyHours  Grade  Passed  Passed
0  Peter         8.0    9.0     NaN    True
1   Luis         7.0    9.0     NaN    True
2    Pep         0.0    0.0     NaN   False
3   Susi         9.0    5.0     NaN    True
4   Pepa         9.0    6.0     NaN    True
5  Jaume         0.0    4.0     NaN   False
0    NaN         NaN    NaN    True   False
1    NaN         NaN    NaN    True   False
2    NaN         NaN    NaN   False   False
3    NaN         NaN    NaN    True   False
4    NaN         NaN    NaN    True   False
5    NaN         NaN    NaN   False   False